Tekla Open API Reference for Tekla Structures 2025
ModelInfo.SingleUserModel Property
 The read-only property if the Tekla Structures model is a single user model.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SingleUserModel { get; }
Public ReadOnly Property SingleUserModel As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
ModelInfo Class
Tekla.Structures.Model Namespace